000100 identification division.
000200 program-id. hello.
000300 author. Isaiah W.
000400 date-written. April 18th, 2023.
000500 procedure division.
000600 display "hello world".
000700*
000800 stop run.
